// Направете функция която се казва strhalf, която приема символен низ, и двоен указател (указател към указател) от тип char. Функцията трябва да насочи указателя към който сочи втория аргумент към средата на символния низ. Създайте символен низ и указател от тип char и извикайте функцията с помощта на тези аргументи (не забравайте, че понеже функцията приема двоен указател трябва да подадете адреса на указателя от тип char). След извикването на функцията strhalf, принтирайте променения указател с помощта на printf(“%s”) - трябва се принтира само втората половина от първоначалния символен низ.


void strhalf(const char * str[], char **p)
{
    


}